


def show_menu():
        print("~~~~~~~~~这是分割线~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~")
        print('+-----------------------------+')
        print('| 1) 输入学生信息             |')
        print('| 2) 显示学生信息             |')
        print('| 3) 删除学生信息             |')
        print('| 4) 修改学生信息             |')
        print('| 5) 根据学生年龄由高-低排序  |')
        print('| 6) 根据学生年龄由低-高排序  |')
        print('| 7) 根据学生成绩由高-低排序  |')
        print('| 8) 根据学生成绩由低-高排序  |')
        print('| 9) 保存信息到文件(si.txt)   |')
        print('| 10)从文件中读取数据(si.txt) |')
        print('| q) 输入q键退出              |')  
        print('+-----------------------------+')
     